package com.start.kernel.config;

/**
 * 全局消息
 * @author Start
 */
public interface IMsg {
	/**
	 * OK
	 */
	final int _200=200;
	/**
	 * 禁止访问
	 */
	final int _403=403;
	/**
	 * 无法访问
	 */
	final int _404=404;
	/**
	 * 当前请求方式无法访问
	 */
	final int _405=405;
	/**
	 * 请求主体内容不能为空
	 */
	final int _411=411;
	/**
	 * 请求主体内容长度超过限制 
	 */
	final int _413=413;
	/**
	 * 请求URL的参数长度超过限制
	 */
	final int _414=414;
	/**
	 * 不支持媒体类型 
	 */
	final int _415=415;
	/**
	 * 内部服务器出错
	 */
	final int _500=500;
	/**
	 * 应用程序异常
	 */
	final int _992=992;
	/**
	 * 系统维护中
	 */
	final int _993=993;
	/**
	 * 接口维护中
	 */
	final int _994=994;
	/**
	 * 该接口暂不开放
	 */
	final int _995=995;
	/**
	 * 未知错误 
	 */
	final int _996=996;
	/**
	 * 系统资源不足
	 */
	final int _997=997;
	/**
	 * 系统设置错误
	 */
	final int _998=998;
	/**
	 * 系统忙，请稍候再试
	 */
	final int _999=999;
	/**
	 * DES加密时发生异常
	 */
	final int _1001=1001;
	/**
	 * DES解密时发生异常
	 */
	final int _1002=1002;
	/**
	 * URL编码出错
	 */
	final int _1003=1003;
	/**
	 * URL解码出错
	 */
	final int _1004=1004;
	/**
	 * 数据出现异常
	 */
	final int _1005=1005;
	/**
	 * 日期时间格式有误
	 */
	final int _1006=1006;
	/**
	 * IP受限，禁止访问
	 */
	final int _2001=2001;
	/**
	 * 非法操作，禁止访问
	 */
	final int _2002=2002;
	/**
	 * 权限不足，禁止访问
	 */
	final int _2003=2003;
	/**
	 * 操作来源受限，禁止访问
	 */
	final int _2004=2004;
	/**
	 * 签名不能为空
	 */
	final int _2005=2005;
	/**
	 * 签名不匹配
	 */
	final int _2006=2006;
	/**
	 * 签名时发现异常
	 */
	final int _2007=2007;
	/**
	 * 请求时间不能为空
	 */
	final int _2008=2008;
	/**
	 * 请求时间格式不正确
	 */
	final int _2009=2009;
	/**
	 * 请求时间已失效
	 */
	final int _2010=2010;
	/**
	 * 请求数据异常
	 */
	final int _2011=2011;
	/**
	 * 请求的数据长度超过限制
	 */
	final int _2012=2012;
	/**
	 * 主体XML解析异常
	 */
	final int _2013=2013;
	/**
	 * 请求主体内容获取失败
	 */
	final int _2014=2014;
	/**
	 * IP地址不能为空
	 */
	final int _2015=2015;
	/**
	 * IP地址格式不正确
	 */
	final int _2016=2016;
	/**
	 * 公共模块
	 */
	public interface ICommon{
		//登陆日志
		int _101001=101001;
		int _101002=101002;
		int _101003=101003;
		//文件
		//请求数据大小与传输文件大小不一致
		int _102001=102001;
		//文件校验码不正确
		int _102002=102002;
		//文件大小与原始文件不一致
		int _102003=102003;
		//传输文件与原始文件校验码不相同
		int _102004=102004;
		//GZIP解压时发生异常
		int _102005=102005;
		//文件校验码与原始文件不一致
		int _102006=102006;
		//文件存储时出现异常
		int _102007=102007;
		//文件存储信息不存在
		int _102008=102008;
		//文件记录不存在
		int _102009=102009;
		//文件不存在
		int _102010=102010;
	}
	//
	//
	/***************************************业务模块*************************************/
	//
	//
	public interface IDiscover{
		//账户
		int _301001=301001;
		int _301002=301002;
		int _301003=301003;
		int _301004=301004;
		int _301005=301005;
		int _301006=301006;
		int _301007=301007;
		int _301008=301008;
		int _301009=301009;
		int _301010=301010;
		int _301011=301011;
		int _301012=301012;
		int _301013=301013;
		//账户信息
		int _302001=302001;
		//贴子
		//内容不能为空
		int _303001=303001;
		//经度不能为空
		int _303002=303002;
		//纬度不能为空
		int _303003=303003;
		//贴子编号不能为空
		int _303004=303004;
		//贴子编号格式不正确
		int _303005=303005;
		//贴子不存在
		int _303006=303006;
	}
	
}